Tekla Open API Reference for Tekla Structures 2025
AnalysisResult.DeleteAll Method
 Delete all analysis results.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static bool DeleteAll()
Public Shared Function DeleteAll As Boolean
Return Value
Type: Boolean
True if successful.
Examples
 Delete all analysis results.
var result = AnalysisResult.DeleteAll();
See Also
Reference
AnalysisResult Class
Tekla.Structures.Analysis Namespace